{
    "terms": [
        {
            "term": "Abduction",
            "definition": "Movement of a body part away from the midline of the body. For example, lifting your arm out to the side is shoulder abduction.",
            "category": "Movement"
        },
        {
            "term": "Adduction",
            "definition": "Movement of a body part toward the midline of the body. The opposite of abduction.",
            "category": "Movement"
        },
        {
            "term": "Active Range of Motion (AROM)",
            "definition": "The range of movement at a joint that a person can achieve using their own muscle power, without external assistance.",
            "category": "Assessment"
        },
        {
            "term": "Atrophy",
            "definition": "Decrease in size or wasting away of muscle tissue, often due to disuse, injury, or disease.",
            "category": "Pathology"
        },
        {
            "term": "Balance",
            "definition": "The ability to maintain the body's center of mass over its base of support. Essential for standing, walking, and all functional activities.",
            "category": "Function"
        },
        {
            "term": "Biomechanics",
            "definition": "The study of mechanical laws relating to the movement and structure of living organisms. Important for understanding how the body moves.",
            "category": "Science"
        },
        {
            "term": "Chronic Pain",
            "definition": "Pain that persists beyond the normal healing time, typically defined as lasting more than 3-6 months.",
            "category": "Pain"
        },
        {
            "term": "Contracture",
            "definition": "Permanent shortening of a muscle or joint that limits normal movement. Can result from prolonged immobility or spasticity.",
            "category": "Pathology"
        },
        {
            "term": "Dorsiflexion",
            "definition": "Movement that brings the top of the foot closer to the shin. The opposite of plantarflexion.",
            "category": "Movement"
        },
        {
            "term": "Edema",
            "definition": "Swelling caused by excess fluid trapped in the body's tissues. Common after injury or surgery.",
            "category": "Pathology"
        },
        {
            "term": "Extension",
            "definition": "Movement that increases the angle between body parts. For example, straightening the knee is knee extension.",
            "category": "Movement"
        },
        {
            "term": "Flexion",
            "definition": "Movement that decreases the angle between body parts. For example, bending the elbow is elbow flexion.",
            "category": "Movement"
        },
        {
            "term": "Gait",
            "definition": "The manner or pattern of walking. Gait analysis is used to identify abnormalities and guide treatment.",
            "category": "Function"
        },
        {
            "term": "Hypertrophy",
            "definition": "Increase in the size of muscle fibers, typically resulting from strength training.",
            "category": "Physiology"
        },
        {
            "term": "Inflammation",
            "definition": "The body's protective response to injury or infection, characterized by redness, heat, swelling, and pain.",
            "category": "Pathology"
        },
        {
            "term": "Isometric Exercise",
            "definition": "Exercise where the muscle contracts without changing length. For example, pushing against a wall.",
            "category": "Exercise"
        },
        {
            "term": "Joint Mobilization",
            "definition": "Passive movement techniques applied to joint surfaces to restore normal motion and reduce pain.",
            "category": "Treatment"
        },
        {
            "term": "Kinesiology",
            "definition": "The study of human movement. Forms the foundation of physiotherapy practice.",
            "category": "Science"
        },
        {
            "term": "Ligament",
            "definition": "Tough band of fibrous tissue that connects bones to other bones at a joint.",
            "category": "Anatomy"
        },
        {
            "term": "Manual Therapy",
            "definition": "Hands-on treatment techniques used by physiotherapists to treat muscle and joint conditions.",
            "category": "Treatment"
        },
        {
            "term": "Muscle Tone",
            "definition": "The continuous passive partial contraction of muscles at rest. Abnormal tone can be hypertonic (too high) or hypotonic (too low).",
            "category": "Physiology"
        },
        {
            "term": "Neuroplasticity",
            "definition": "The brain's ability to reorganize itself by forming new neural connections. Key concept in neurological rehabilitation.",
            "category": "Neurology"
        },
        {
            "term": "Osteoarthritis",
            "definition": "Degenerative joint disease characterized by breakdown of cartilage. The most common form of arthritis.",
            "category": "Pathology"
        },
        {
            "term": "Passive Range of Motion (PROM)",
            "definition": "The range of movement at a joint achieved with external assistance, without active muscle contraction.",
            "category": "Assessment"
        },
        {
            "term": "Plantarflexion",
            "definition": "Movement that points the toes downward, like pressing a gas pedal. The opposite of dorsiflexion.",
            "category": "Movement"
        },
        {
            "term": "Plantarflexion",
            "definition": "Movement that points the toes downward, like pressing a gas pedal. The opposite of dorsiflexion.",
            "category": "Movement"
        },
        {
            "term": "Proprioception",
            "definition": "The body's ability to sense its position and movement in space without visual input. Important for balance and coordination.",
            "category": "Neurology"
        },
        {
            "term": "Range of Motion (ROM)",
            "definition": "The full movement potential of a joint, usually measured in degrees.",
            "category": "Assessment"
        },
        {
            "term": "Rehabilitation",
            "definition": "The process of restoring function and quality of life after injury, illness, or surgery.",
            "category": "Treatment"
        },
        {
            "term": "Spasticity",
            "definition": "A condition in which muscles have increased tone, causing stiffness and difficulty with movement. Common after stroke or spinal cord injury.",
            "category": "Neurology"
        },
        {
            "term": "Tendon",
            "definition": "Tough band of fibrous tissue that connects muscle to bone, transmitting the force of muscle contraction.",
            "category": "Anatomy"
        },
        {
            "term": "Therapeutic Exercise",
            "definition": "Exercise prescribed to address specific impairments and achieve therapeutic goals.",
            "category": "Treatment"
        },
        {
            "term": "Ultrasound Therapy",
            "definition": "Use of sound waves to treat soft tissue injuries by promoting healing and reducing inflammation.",
            "category": "Treatment"
        },
        {
            "term": "Vestibular System",
            "definition": "The sensory system in the inner ear that contributes to balance and spatial orientation.",
            "category": "Anatomy"
        },
        {
            "term": "Weight-Bearing",
            "definition": "The amount of body weight that can be placed through a limb. Often modified after injury or surgery.",
            "category": "Function"
        }
    ]
}